In [21]:
import pandas as pd

In [22]:
series = pd.Series(["BMW", "Toyota", "Honda"])

In [23]:
colors = pd.Series(['red', 'blue', 'green'])

In [24]:
series, colors

(0       BMW
 1    Toyota
 2     Honda
 dtype: object,
 0      red
 1     blue
 2    green
 dtype: object)

In [25]:
car_data = pd.DataFrame({"car make": series, "color": colors})

In [26]:
car_data

  car make  color
0      BMW    red
1   Toyota   blue
2    Honda  green

In [27]:
car_sales = pd.read_csv("..\ztm-ml\data\car-sales.csv")

<>:1: SyntaxWarning: invalid escape sequence '\z'
<>:1: SyntaxWarning: invalid escape sequence '\z'
C:\Users\tyan\AppData\Local\Temp\ipykernel_37112\4181156617.py:1: SyntaxWarning: invalid escape sequence '\z'
  car_sales = pd.read_csv("..\ztm-ml\data\car-sales.csv")

In [28]:
# Attributes
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [29]:
# Functions
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [30]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [31]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [32]:
# loc refers to indexes
car_sales.loc[0]

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [33]:
# .iloc refers to position
car_sales.iloc[0]

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [34]:
car_sales["Price"] = car_sales["Price"].str.replace(
    "[\$\,]", "", regex=True
)

<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:2: SyntaxWarning: invalid escape sequence '\$'
C:\Users\tyan\AppData\Local\Temp\ipykernel_37112\755964021.py:2: SyntaxWarning: invalid escape sequence '\$'
  "[\$\,]", "", regex=True

In [35]:
car_sales

     Make Colour  Odometer (KM)  Doors     Price
0  Toyota  White         150043      4   4000.00
1   Honda    Red          87899      4   5000.00
2  Toyota   Blue          32549      3   7000.00
3     BMW  Black          11179      5  22000.00
4  Nissan  White         213095      4   3500.00
5  Toyota  Green          99213      4   4500.00
6   Honda   Blue          45698      4   7500.00
7   Honda   Blue          54738      4   7000.00
8  Toyota  White          60000      4   6250.00
9  Nissan  White          31600      4   9700.00

In [38]:
car_sales.groupby(['Make']).mean(numeric_only=True)

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75